# Даны два списка чисел. Посчитайте, сколько чисел содержится одновременно
# как в первом списке, так и во втором.

a = {1, 2, 3, 4, 5}
b = {6, 8, 9, 0, 1}
print(len(a & b))


