# Написать функцию square, принимающую 1 аргумент — сторону квадрата
# и возвращающую 3 значения (с помощью кортежа): периметр квадрата,
# площадь квадрата и диагональ квадрата. Сторону квадрата вводить с клавиатуры
# import math
#
#
# def square(a):
#     b = 4 * a
#     c = a ** 2
#     d = math.sqrt(2 * a ** 2)
#     return b, c, d
#
#
# print(square(int(input())))

# def factorial(n):
#     if n != 0:
#         return n * factorial(n - 1)
#     else:
#         return 1
#
#
# print(factorial(5))

# a = [1, 2, 3, 4, 5]
#
#
# def fk(b):
#     if b == []:
#         return 0
#     else:
#         return b[0] + fk(b[1:])
#
#
# print(fk(a))
